---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaStrongAxis
source: html/f17e42b3-e2d2-f20a-dd03-f47e070b5d2f.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.ShearAreaStrongAxis Property

Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).

## Syntax (C#)
```csharp
public double ShearAreaStrongAxis { get; set; }
```